cases/hydrodynamics/floatingObject_spring-olaflow-5.0.0/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");


interpolationScheme cellPoint;

setFormat       raw;

sets
(
    lineX1
    {
        type    uniform;
        axis    z;
        start   ( 0 0 0);
        end     ( 0 0 10);
        nPoints 100;
    }
    lineX2
    {
        type    uniform;
        axis    z;
        start   ( 3 0 0);
        end     ( 3 0 10);
        nPoints 100;
    }
    lineX3
    {
        type    uniform;
        axis    z;
        start   ( 5 0 0);
        end     ( 5 0 10);
        nPoints 100;
    }
);

fields          ( alpha.water );


// ************************************************************************* //
